//#include "stdio.h"
//
//int main()
//{
//	char str[80];//用于存放字符的字符型数组，上限80
//	int n[26]={0};//用于记录各字母出现次数的数组
//	int i, j;//循环变量
//	for (i = 0; i < 80; i++)//输入字符，上限80
//	{
//		scanf_s("%c", &str[i]);
//		if (str[i] == '\n')//遇到回车就结束输入
//			break;
//	}
//	for (i = 0; i < 80; i++)//历遍数组内所有字符
//	{
//		if (str[i] == '\n')//用于记录被输入的字符个数(不区分字符是否为字母)
//			break;
//		for (j = 0; j < 26; j++)//计算各字母出现次数
//			if ((str[i] == 'A' + j) || (str[i] == 'a' + j))//同一字母的大小写的次数合并计算
//			{
//				n[j]++;
//				break;
//			}
//	}
//	printf("the number of char is %d\n", i);//显示被输入的字符个数(不区分字符是否为字母)
//	for (j = 0; j < 26; j++) 
//	{
//		if (n[j] == 0)
//			continue;//不显示未出现的字母
//		printf("%c:", 65 + j);//用大写字母表示该字母的大小写出现的情况总和
//		printf("%d\n", n[j]);
//	}
//	return 0;
//}